{
  "mudah": [
    {
      "title": "Kucing Saya",
      "content": "Kucing saya bernama Si Comel. Ia berwarna oren dan putih. Si Comel suka bermain dengan bola wol. Setiap hari, ia tidur di atas katil saya. Saya suka memberi Si Comel makanan ikan. Ia selalu mengeong apabila lapar. Kucing saya sangat comel dan manja."
    },
    {
      "title": "Sekolah Saya",
      "content": "Sekolah saya terletak di Jalan Merdeka. Ia mempunyai bangunan berwarna kuning. Ada banyak bilik darjah dan makmal sains. Padang permainan sekolah saya sangat besar. Saya suka bermain bola sepak di sana. Perpustakaan sekolah penuh dengan buku-buku menarik. Guru-guru di sekolah saya sangat baik dan peramah."
    },
    {
      "title": "Rumah Saya",
      "content": "Rumah saya terletak di Taman Harmoni. Ia mempunyai dua tingkat dan berwarna biru. Di tingkat bawah ada ruang tamu, dapur, dan bilik makan. Tingkat atas pula mempunyai tiga bilik tidur. Halaman rumah saya ditanam dengan bunga-bunga cantik. Saya suka bermain di taman belakang rumah dengan adik saya."
    },
    {
      "title": "Kawan Saya",
      "content": "Kawan baik saya bernama Ali. Kami telah berkawan sejak darjah satu. Ali sangat pandai dalam matematik. Dia selalu membantu saya membuat kerja rumah. Kami suka bermain bola sepak bersama-sama di padang. Pada hujung minggu, kami selalu ke perpustakaan untuk membaca buku. Ali adalah kawan yang sangat setia dan baik hati."
    },
    {
      "title": "Bunga Raya",
      "content": "Bunga raya adalah bunga kebangsaan Malaysia. Ia mempunyai lima kelopak berwarna merah. Bunga raya boleh ditemui di banyak tempat di Malaysia. Ia tumbuh dengan mudah di halaman rumah dan taman-taman. Bunga raya melambangkan keberanian dan kecantikan. Ia juga digunakan dalam masakan tradisional Melayu. Saya sangat suka melihat bunga raya yang mekar."
    },
    {
      "title": "Hobi Saya",
      "content": "Hobi saya ialah melukis. Saya suka melukis pemandangan alam dan haiwan. Setiap hari, saya akan meluangkan masa satu jam untuk melukis. Saya menggunakan pensil warna dan cat air. Ibu bapa saya sangat menyokong hobi saya ini. Mereka selalu membeli buku lukisan untuk saya. Saya berharap suatu hari nanti dapat menjadi pelukis terkenal."
    }
    {
      "title": "Modul Bacaan Pertama",
      "content": "Pada pagi ini, cuacanya cerah dan udaranya juga nyaman. Bapa ingin membawa kami sekeluarga untuk berkelah di tepi pantai. Kami semua pun menganggukkan kepala tanda setuju. Setelah kami menyediakan semua barang yang diperlukan di tepi pantai, kami pun menaiki kereta Myvi bapa saya."
    }
  ],
  "sederhana": [
    {
      "title": "Hari Raya Aidilfitri",
      "content": "Hari Raya Aidilfitri adalah perayaan penting bagi umat Islam di Malaysia. Ia menandakan berakhirnya bulan Ramadan. Pada hari ini, orang ramai akan memakai pakaian baru dan mengunjungi rumah sanak-saudara. Makanan tradisional seperti rendang, lemang, dan ketupat disediakan. Kanak-kanak gembira kerana menerima duit raya. Suasana di kampung-kampung sangat meriah dengan rumah terbuka dan bunyi mercun."
    },
    {
      "title": "Makanan Kegemaran Saya",
      "content": "Makanan kegemaran saya ialah nasi lemak. Ia adalah hidangan tradisional Malaysia yang sangat popular. Nasi lemak terdiri daripada nasi yang dimasak dengan santan dan daun pandan. Ia dihidangkan dengan sambal, ikan bilis, timun, telur rebus, dan kacang tanah. Kadang-kadang, ia juga disajikan dengan ayam rendang atau sotong sambal. Saya suka makan nasi lemak untuk sarapan. Rasanya yang pedas dan berlemak sangat menyelerakan."
    },
    {
      "title": "Sukan di Malaysia",
      "content": "Malaysia terkenal dengan pelbagai jenis sukan. Badminton adalah salah satu sukan yang paling popular. Ramai pemain badminton Malaysia telah memenangi kejohanan dunia. Selain itu, bola sepak juga sangat digemari. Pasukan kebangsaan Malaysia, Harimau Malaya, sering bertanding di peringkat antarabangsa. Sukan-sukan tradisional seperti sepak takraw juga masih dimainkan. Setiap tahun, Malaysia menganjurkan banyak acara sukan antarabangsa seperti Perlumbaan Formula 1 dan Kejohanan Golf CIMB Classic."
    },
    {
      "title": "Pasar Malam",
      "content": "Pasar malam adalah sebahagian daripada budaya Malaysia yang unik. Ia berlangsung pada waktu malam di pelbagai lokasi di seluruh negara. Di pasar malam, anda boleh menemui pelbagai jenis makanan, pakaian, barangan elektronik, dan banyak lagi. Makanan popular di pasar malam termasuk satay, char kuey teow, dan air tebu. Suasana di pasar malam sangat meriah dengan cahaya terang dan muzik. Ia adalah tempat yang sesuai untuk berinteraksi dengan masyarakat tempatan dan merasai budaya Malaysia."
    }
  ],
  "sukar": [
    {
      "title": "Pemanasan Global",
      "content": "Pemanasan global adalah fenomena peningkatan suhu purata bumi secara berterusan. Ia disebabkan terutamanya oleh pelepasan gas rumah hijau seperti karbon dioksida ke atmosfera. Aktiviti manusia seperti pembakaran bahan api fosil dan penebangan hutan mempercepatkan proses ini. Kesan pemanasan global termasuk kenaikan paras laut, cuaca ekstrem yang lebih kerap, dan perubahan dalam corak hujan. Ini boleh mengancam biodiversiti dan menjejaskan pertanian. Untuk menangani masalah ini, usaha global diperlukan untuk mengurangkan pelepasan karbon dan beralih kepada sumber tenaga yang lebih bersih."
    },
    {
      "title": "Teknologi Moden",
      "content": "Teknologi moden telah mengubah cara kita hidup, bekerja, dan berkomunikasi. Internet telah menjadikan dunia sebuah 'kampung global' di mana maklumat boleh diakses dengan mudah. Telefon pintar membolehkan kita berhubung dengan sesiapa sahaja di mana-mana pada bila-bila masa. Kecerdasan buatan (AI) dan pembelajaran mesin sedang merevolusi pelbagai industri, dari pembuatan hingga penjagaan kesihatan. Namun, kemajuan teknologi juga membawa cabaran seperti isu privasi data dan ketidaksamaan digital. Adalah penting bagi masyarakat untuk mengimbangi manfaat teknologi dengan potensi risikonya."
    },
    {
      "title": "Sejarah Malaysia",
      "content": "Sejarah Malaysia adalah kisah yang kaya dan kompleks. Negara ini telah melalui zaman kerajaan Melayu awal, penjajahan Portugis, Belanda, dan British, serta pendudukan Jepun semasa Perang Dunia Kedua. Kemerdekaan dicapai pada tahun 1957, diikuti oleh pembentukan Malaysia pada tahun 1963. Sepanjang sejarahnya, Malaysia telah menjadi tempat pertemuan pelbagai budaya, membentuk masyarakat berbilang kaum yang unik. Negara ini telah mengalami transformasi daripada ekonomi berasaskan pertanian kepada negara perindustrian moden. Pemahaman tentang sejarah ini penting untuk menghargai kepelbagaian dan kemajuan Malaysia hari ini."
    },
    {
      "title": "Kepentingan Pendidikan",
      "content": "Pendidikan memainkan peranan penting dalam pembangunan individu dan masyarakat. Ia bukan sahaja memberikan pengetahuan dan kemahiran, tetapi juga membentuk pemikiran kritis dan nilai-nilai moral. Dalam era globalisasi dan ekonomi berasaskan pengetahuan, pendidikan menjadi kunci untuk bersaing di pasaran kerja antarabangsa. Ia juga penting untuk pembangunan sosial, membantu mengurangkan kemiskinan dan ketidaksamaan. Pendidikan sepanjang hayat menjadi semakin penting kerana dunia terus berubah dengan pesat. Oleh itu, pelaburan dalam sistem pendidikan yang berkualiti dan inklusif adalah penting untuk masa depan sesebuah negara."
    },
    {
      "title": "Alam Sekitar",
      "content": "Alam sekitar merangkumi semua unsur hidup dan bukan hidup di sekeliling kita. Ia termasuk udara, air, tanah, tumbuh-tumbuhan, dan haiwan. Kesihatan alam sekitar adalah penting untuk kelangsungan hidup manusia dan semua makhluk. Namun, aktiviti manusia seperti pencemaran, penebangan hutan, dan penggunaan sumber alam yang berlebihan telah menyebabkan kerosakan alam sekitar yang serius. Perubahan iklim, kepupusan spesies, dan pencemaran air adalah antara isu-isu alam sekitar yang mendesak. Usaha pemuliharaan dan pembangunan lestari diperlukan untuk melindungi alam sekitar. Setiap individu mempunyai peranan dalam menjaga alam sekitar melalui amalan hidup yang lebih mesra alam."
    }
  ]
}
